{"template":"__react_static_root__/src/containers/Markdown","sharedHashesByProp":{},"data":{"content":"# Our mission\n\nThe 2020th 8th round of the Prototype Fund brought up this group of people, engaged into the creation of a tool for managing and organizing a community garden. We are a group  of people already being involved in urban gardening projects and want to use our knowledge about the challenges around maintaining an open community of volunteers and passionate gardeners to create a beautiful place.\n\nOur mission is to make it easier for those groups and cooperatives to organize themselves, connect to other initiatives or maybe start a new project from scratch with an elaborate tool on their side to fulfil the vision.\n\n# Pergola\n\nOur main application is called _Pergola_. A hybrid app, which can be build for various platforms and has a lightweight\nbackend. See our [demo](https://live.pergola.gra.one/) and give us some [feedback](https://stephho.typeform.com/to/eTiWosV0) on it! We'd love to hear what you think 🤩 \n\n# Some of our guidelines\n\n- open source, open data\n- data transparency\n- self hosting capability + SaaS\n- no dependency on commercial tools or services\n- but still optional interoperability with existing ones\n\n\n\n# Unsere Mission \n\nDie 8. Runde des Prototype Fund hat 2020 eine paar Leute zusammen gebracht, die sich für die Entwicklung eines Tools zum Managen und Organisieren eines Gemeinschaftsgartens engagieren. Wir sind eine Gruppe von Menschen, die schon in städtischen Gartenprojekten involviert sind und wollen unser Wissen über die Herausforderungen bei der Aufrechterhaltung einer offenen Gemeinschaft von Freiwilligen und leidenschaftlichen Gärtnern nutzen, um einen wunderschönen Ort zu schaffen.\n\nUnsere Mission ist es, solchen Gruppen und Genossenschaften die Selbstorganisation zu erleichtern, sich mit anderen Initiativen zu verbinden oder vielleicht auch von Grund auf ein neues Projekt mit einem ausgeklügelten Werkzeug an der Seite zu starten, um eigene Visionen zu erfüllen.\n\n\n# Pergola\n\nUnsere Hauptanwendung heißt _Pergola_. Das ist eine hybride App, die auf diversen Plattformen genutzt werden kann und ein einfaches Backend hat. Schau dir unsere [Demo](https://live.pergola.gra.one/) an und gib dein [Feedback](https://stephho.typeform.com/to/eTiWosV0) ab! Wir würden uns über deine Gedanken dazu sehr freuen! 🤩 \n\n# einige unserer Vorsätze\n\n- open source, open data\n- Datentransparenz\n- Möglichkeit selbst zu hosten + SaaS\n- keine Abhängigkeit von kommerziellen Tools und Services\n- aber optional der Austausch mit solchen, sofern sie schon genutzt werden"},"path":"/"}
