{"template":"__react_static_root__/src/containers/Post","sharedHashesByProp":{},"data":{"post":{"basename":"(EN)-About-Pergola.md","title":"About-Pergola","lang":"EN","id":601001280,"body":"## About Pergola\n\nWe knew it from the very beginning: what we need for our app, is a cool name people keep in their heads. It should work in english as well, let images arise and, of course, have something to do with plants, nature, community.\n\nOne day, enlightenment hit us suddenly - during one of our team members illness. Poor Philipp had to stay in bed, sleep a lot, and was barely able to stare at his phone screen through glassy eyes. Did it happen in a dream, or in a kind-of-aware state of mind? We will never know. After he got better after a couple of days, he proudly presented a little selection of his best delirium ideas. It only took us a second to decide on our favorite: the pergola. You don't know that? Pergolas represent so many things we also consider as the philosophy around our application.\n\n> A _pergola_ is a climbing aid, something to lean on or a trellis.\n\nThis is what we want our app tp be for the garden community. Giving a structure that is filled by the gardeners themselves. Roses, vetches or ivy? It's up to you, gardeners!\n\n\n> A _pergola_ marks a special place in the garden, typically leading somewhere.\n\nThis is supposed to be the spirit of our app - leading community gardeners the way and giving support. And isn't it special to have a digital support for community garden organization?\n\n\n> A _pergola_ is a construction which is open at the top.\n\nYep, you're right, the app is an open-source project and free for all to take a look in. You decide how you use it. You inspire us to change it.\n\n\n> A _pergola_ is a shaded passage and gives structure to the space.  \n\nThis is how we want our app to be used: save and secure, relaxing, preventing you from the heat of information we all experience nowadays.\n\n![](https://user-images.githubusercontent.com/72280627/108992376-8813b980-7699-11eb-84bc-7332e4d3ce48.jpg)"}},"path":"blog/post/601001280"}
