{"template":"__react_static_root__/src/containers/Post","sharedHashesByProp":{},"data":{"post":{"basename":"(DE)-Wie-es-sich-anfühlt,-Meinungen-in-Zahlen-zu-verwandeln.md","title":"Wie-es-sich-anfühlt,-Meinungen-in-Zahlen-zu-verwandeln","lang":"DE","id":491565543,"body":"## Wie es sich anfühlt, Meinungen in Zahlen zu verwandeln\n\nWie schon im [letzten Kapitel](/blog/post/1458380018/) beschrieben, hatten wir ungefähr 20 geniale Ideen, die alle irgendwie die Bedürfnisse und Probleme unserer Nutzer aufgriffen. Priorisieirung dringend benötigt!\nBeim ersten Mal haben wir uns persönlich getroffen. Für das erste Meeting haben wir uns für zunächst die Hälfte der Ideen vorgenommen. So lief es ab:\n\n1. Wir haben ein gemeinsames Verständnis der Methode hergestellt, indem wir sie kurz vorgestellt und offene Fragen diskutiert haben.\n\n\n2. Wir haben uns auf einen strengen Zeitplan für die nächste Stunde geeinigt, der uns durch mindestens 10 Ideen führen sollte.\n\n\n3. Wir begannen mit der ersten Idee:\n\n* Eine Person stellt die Idee vor (1 Minute)\n* Das Team stellt Rückfragen, um das Verständnis der Idee zu vertiefen (2 Minuten)\n* Jedes Teammitglied bewertet die Idee für sich in den folgenden Dimensionen: Reichweite, Wirkung, Vertrauen, Aufwand (2 Minuten)\n* Die Bewertungen werden gesammelt und in einem sehr komplizierten Excel-Dokument zusammengeführt ;-) (1 Minute)\n\n4. Wir wiederholten Schritt 3 solange wir konnten.\n\n\nUnglaublich, aber wahr: es hat funktioniert. Wir haben die zweite Hälfte in einem BigBlueButton-Meeting bewertet, da wir uns aufgrund der COVID19-Beschränkungen nicht mehr vor Ort treffen konnten. Funktioniert hat das genauso gut – wir waren ja auch bereits gut mit der Methode vertraut.\n\nNun war die Excel-Tabelle bereit für den letzten Schliff und spuckte uns bereitwillig eine priorisierte Rangliste unserer Ideen aus. Das war ein großartiges Gefühl!\n\n## Die Gewinner\n\nHier sind sie also, unser vier vielversprechendsten Features, die wir mit der RICE-Methode identifizieren konnten.\n\n![Top Features](https://github.com/community-garden/community-garden.github.io/wiki/images/TopFeatures_EN___1_2x.png)\n\n### 1. Der Gießplan\n\nEin digitaler, interaktiver Gießplan regelt die faire und flexible Verteilung der Gießeinsätze viel besser als ein Excel-Sheet.\n\n### 2. Gartenzeit\n\nWorkshops und andere coole Gartentermine werden öffentlich sichtbar. Kalender-Import und Teilnehmer-Management sind denkbare Benefits.\n\n### 3. Was geht?\n\nAuf einem individuellen Dashboard sehen Gärtner*innen genau das, was sie brauchen. Kombiniert Inhalte aus anderen Features und Anwendungen.\n\n### 4. Erntereif\n\nWie ein Garten seine Ernte verteilt, wird hier geklärt. Ein Feature für eine bessere Verwertung des kostbaren Ertrags und eher zurückhaltende Erntehelfer*innen.\n"}},"path":"de/blog/post/491565543"}
