{"template":"__react_static_root__/src/containers/Markdown","sharedHashesByProp":{},"data":{"content":"(english version below)\n\nUnsere Projektlaufzeit haben wir mit Hilfe eines [Gantt-Diagramm/ Balkendiagramm](https://user-images.githubusercontent.com/72280627/102685377-736dfd80-41e0-11eb-871d-6fcb15532428.png) vorab zeitlich und inhaltlich strukturiert. Es hilft uns jetzt immer wieder zu prüfen, ob wir noch gut im Rennen sind. Aber es sind auch Anpassungen nötig, die sich z.B. auf Grund von User-Feedback ergeben haben.\n\n\n\n![](https://user-images.githubusercontent.com/72280627/102597251-a8178180-411a-11eb-958d-b10ce2b3e5f1.jpg)\n\n\n\n\nFolgende Meilensteine erreichen wir bis Jahresende:\n\n- Analyse: Für die Analyse-Phase haben wir uns viel Zeit gelassen, um den ersten Entwurf aus dem Antrag so genau wir möglich weiterzuzeichnen.\nFür den Inhalt unserer App haben wir zuerst unsere Köpfe rauchen lassen, haben dann Gärtner aus anderen Gärten befragt und schließlich eine Liste von Modulen geschrieben. Gleichzeitig wurden die technischen Grundlagen geschaffen, indem ein UI-Framework erarbeitet und der Technologie Stack erprobt wurde. Wir haben dafür nach links und rechts geschaut und aus Erfahrung geschöpft.\n\n- UX-Testing:  Nutzermeinungen und -bedürfnisse werden bei uns von Anfang an groß geschrieben! Inzwischen haben wir eine \"Testgemeinde\" gegründet, die unsere Module ausgiebig im UX testet noch bevor sie programmiert werden.\n\n- Modul Gießplan (UX+Code): Unser Gießplan umfasst das Management der freiwilligen Gießer. Vorab werden Verfügbarkeiten eingetragen um dann zum Stichtag den endgültigen Dienst berechnen zu lassen. Per Erinnerungs-Funktion sollen die Gärtner dann zur rechten Zeit in den Garten geschickt werden. Wer sich in die App einloggt, kann sogar sehen, mit wem er sich den Gießdienst teilt. Auch spontane Übernahmen von Gießaufgaben bleiben möglich.\n\n- Modul Was geht? (nur UX): Dieses Modul soll den Gärtner je nach seinen Vorlieben darüber informieren, was gerade im Garten passiert und welche Vorhaben anstehen.\n\n\nund diese Meilensteine haben wir uns noch bis Ende der Laufzeit vorgenommen:\n\n- Modul Workshops und Termine verwalten: Unser Garten ist Gastgeber für Vereine und Organisationen. Es gibt dadurch eine Workshop-Reihe, die sich an Gärtner richtet. Aber auch geschlossene Veranstaltungen, die nicht von den Gärtner gestört werden sollten, finden statt. Die Gartengemeinschaft trifft sich auch z.T. unregelmäßig zum Gärtnern, für Arbeitseinsätze und zum Feiern. All das wird in diesem Modul zusammen gefasst.\n\n- Modul Erntereif: Hier sollen Infos zur Ernte übermittelt werden: Was gibt es gerade zu ernten? Was wird erst demnächst ernetreif? Was ist zwar reif, soll aber nicht geerntet werden? Wo wird Saatgt gezüchtet? Was ist im Übermaß vorhanden? Wie kann man es verwerten?\n\n- Dokumentation von Quellcode und Nutzerführung\n- Testphase\n- Abschlussbericht\n\n\n## Logbuch\n\nVersion 1: App-Gerüst, Login, Gießplan: erscheint Anfang Januar 2021 \n\n"},"path":"milestones"}
