{"template":"__react_static_root__/src/containers/Post","sharedHashesByProp":{},"data":{"post":{"basename":"About-Pergola-(EN).md","title":"About-Pergola","id":1654014330,"body":"# About Pergola\n\n## Where do we come from?\nThe 2020th 8th round of the prototype fund brought up this group of five people, engaged into the creation of a tool for managing and organizing a community garden. As we are already involved in urban gardening projects ourselves, we enjoy two main benefits: Firstly, of course, our own everyday challenges, experiences and knowledge about community gardening. Secondly, we can take advantage of an open-minded network of volunteers and passionate gardeners, who will give us insights and guidance on our mission to create a tool, that makes community gardening an even more enjoyable thing to do. \n\n\n## What‘s the problem?\n\nLets be honest: Even gardening all by yourself isn‘t neccessarily an easy thing to do. Now imagine a whole group of individuals trying their best to create a green, fruitful and peaceful place right in the middle of the urban desert. Yup, you guessed it, this offers the chance to become a real project. \nOf course, there is some classic community gardening going on. This includes caring about some shared spaces, planting, weeding, watering and – if everything works out as planned – harvesting. Besides, people come to share their knowledge about planting, constructing, sustainability … or sometimes just to hang out and relax. \n\n![questions people have when sharing a garden space](https://github.com/community-garden/community-garden.github.io/wiki/images/questions-gif.gif)\n\n\n\nThings need to be organized. Tasks need to be done. People need to communicate about it (sometimes a lot!). Plus: Everybody has a life outside of the community garden paradise, which can be quite a hustle sometimes. \nSo this is how we found our mission: With an elaborate tool on their side, we want to make it easier for those groups and cooperatives to organize themselves, connect to other initiatives or maybe even start a new project from scratch to fulfil their vision.\n\n## Our first steps\n\nAs we revealed before, nearly everyone of our project group identifies directly with the people that should benefit from our prototype solution in the future. So of course, we brought up some inital ideas of our own! So at the beginning, there was a list of features, that would make at least a handful of gardeners really happy, e.g. a digital wating plan, an optimized tool for events and tasks to be done or even an interactive map, that uses real time sensor data and informs us about things going on in the garden.\n\n\nAnyway, we considered the existing data base at that point kind of subjective. How representative could the few of us really be? How do our problems match those of other gardeners? What kind of solutions or products might be already in use to tackle those needs? We set up a survey.\n\n![survey results](https://github.com/community-garden/community-garden.github.io/wiki/images/Umfrage___englisch_2x.png)\n\n\n\nAs we looked at those information, future users began to form in our minds and we were able to put all the existing data (and of course some images of people we know) into three personas: Jonas, Franziska und Günther. They were now supposed to be our toughest critics in the prototype development. \n\n\nWith the user data already gathered and the personas put in place, possible features began to pop up in our minds. Also earlier ideas seemed to be verified somehow. Putting all of our ideas in prototypes seemed just not managable with the existing (wo)manpower. But still, we were not able to agree on one, two or three main ideas giving us a straight guidance on creating a prototype. Using the RICE-Score now delivered us some ordinal support on our synthesis. \n"}},"path":"blog/post/1654014330"}
