{"template":"__react_static_root__/src/containers/Post","sharedHashesByProp":{},"data":{"post":{"basename":"(DE)-Das-Problem-definieren.md","title":"Das-Problem-definieren","lang":"DE","id":1099653886,"body":"## Das Problem definieren\n\n### Geschichten aus dem Gemeinschaftsgarten\n\n\nSeien wir mal ehrlich: Sogar alleine Gärtnern ist nicht unbedingt eine einfache Angelegenheit. Man braucht einiges an Wissen, Erfahrung und Ausdauer, damit das Ganze auch gelingt. Nun stellt euch eine ganze Horde an Menschen vor, die alle ihr bestes geben wollen, um eine grüne, fruchtbare und friedliche Insel mitten in der Stadtwüste zu errichten. Ganz genau - sowas wird dann schnell mal zum Großprojekt.\n\n\nNatürlich gibt es viel zu tun beim klassischen Gemeinschaftsgärtnern: Man kümmert sich um gemeinschaftlich genutzte Flächen, es muss gepflanzt, gejätet, bewässert und, wenn alles klappt wie geplant, geerntet werden. Davon abgesehen kommen Menschen in den Garten, um zu lernen und Wissen über das Gärtnern, Bauen oder Nachhaltigkeit zu teilen. Und nicht zuletzt ist der Garten ein Ort für's Entspannen und eine tolle Zeit, die man mit anderen verbringt.\n\n![Fragen von Gemeinschaftsgaertnerinnen](https://github.com/community-garden/community-garden.github.io/wiki/images/questions-gif.gif)\n\n\n\nDinge wollen organisiert werden, Aufgaben erledigt. Kommunikation findet statt - manchmal so viel davon, dass der Überblick verloren geht!. Außerdem hat jeder einzelne noch ein Leben außerhalb des Gartenparadieses, das manchmal auch ganz schön stressig sein kann. \n\nUnd so haben wir fünf Leute zu unserer Mission gefunden: Wir wollen für die Menschen im Garten ein durchdachtes Tool entwickeln, das es einfacher macht, sich in der Gruppe zu organisieren, Wissen auszutauschen, Termine zu managen usw. Vielleicht auch, sich mit anderen Initiativen in Verbindung zu setzen oder vielleicht auch ein völlig neues Gartenprojekt zu starten.\n\n## Frag doch mal die Gemeinschaftsgärtner\\*innen\n\nWie wir bereits verraten haben, identifizieren wir uns fast vollständig mit den Menschen, die später von unserem Prototypen profitieren sollen. Es liegt also auf der Hand, dass wir bereits mit einigen eigenen Ideen gestartet sind. Diese würden wenigstens eine Hand voll Gärtner*innen sehr glücklich machen, wie z. B. ein digitaler Gießplan, eine optimierte Termin- und Aufgabenverwaltung oder eine interaktive Karte. Es wäre auch schön Sensordaten, die uns über den Zustand des Gartens und der Gewächshäuser informieren, zu haben.\n\n\nJedenfalls hatten wir das Gefühl: das ist alles ein bisschen subjektiv. Wie repräsentativ sind wir wirklich? Haben andere Gärtner*innen dieselben Probleme wie wir? Welche Lösungen oder Produkte werden überhaupt bereits genutzt, um das Gärtnern in Gemeinschaft zu organisieren? \n\n### Also haben wir eine erste Umfrage im Gartennetzwerk von Dresden gestartet.\n\n\n![Umfrageergebnisse](https://github.com/community-garden/community-garden.github.io/wiki/images/Umfrage___englisch_2x.png)\n\n\n\nBeim Betrachten der Umfrageergebnisse wurde das Bild von zukünftigen Nutzern unseres Tools immer klarer. Wir waren in der Lage, aus den gesammelten Informationen und natürlich einigen Charakteristika von Menschen, die wir kennen, drei Personas zu bauen: Jonas, Franziska und Günther. Die drei sollten von nun an unsere härtesten Kritiker sein.\n\n\nMit den Nutzerinformationen und unseren drei Personas entstand nun ein Plan nach dem anderen - und tatsächlich schien auch die ein oder andere Ursprungsidee bestätigt. Nun standen wir vor dem nächsten Problem: Diese vielen Ideen können wir unmöglich alle mit den uns zur Verfügung stehenden Ressourcen in einen Prototypen verpacken. Der RICE-Score half uns dabei, eine Rangliste zu bilden und uns auf einige wenige der vielversprechendsten Ideen zu einigen. Sie bilden für uns von nun an eine klare Vision in der Kreation des Prototypen.\n\n\nDas ist Franziska, unsere initiative Familienmanagerin.\n\n![Persona Franziska](https://github.com/community-garden/community-garden.github.io/wiki/images/Franziska__die_initiative_Familienmanagerin_2x.png)\n\nDas ist Jonas, unser nachhaltigkeits-getriebener Student.\n\n![Persona Jonas](https://github.com/community-garden/community-garden.github.io/wiki/images/Jonas__der_nachhaltige_Student_2x.png)\n\nDas ist Günther, unser passionierter Garten-Senior.\n\n![Persona Günther](https://github.com/community-garden/community-garden.github.io/wiki/images/Guenther__der_engagierte_Rentner_2x.png)\n\n\n"}},"path":"de/blog/post/1099653886"}
