{"template":"__react_static_root__/src/pages/blog.tsx","sharedHashesByProp":{},"data":{"posts":[{"basename":"(DE)-Pergola---was-ist-das?.md","title":"DE)-Pergola---was-ist-das?","id":1359446101,"body":"# Pergola\n- Rankgerüst, Anlehnkonstruktion, Spalier\n- Betonung, Gliederung\n- nach oben offen (nur Bewuchs)\n- beschatteter Gang ... führt zum Ziel\n\n\n\n"},{"basename":"Das-Problem-definieren-(DE).md","title":"Das-Problem-definieren","id":1458380018,"body":"## Geschichten aus dem Gemeinschaftsgarten\n\n\nSeien wir mal ehrlich: Sogar alleine Gärtnern ist nicht unbedingt eine einfache Angelegenheit. Man braucht einiges an Wissen, Erfahrung und Ausdauer, damit das Ganze auch gelingt. Nun stellt euch eine ganze Horde an Menschen vor, die alle ihr bestes geben wollen, um eine grüne, fruchtbare und friedliche Insel mitten in der Stadtwüste zu errichten. Ganz genau - sowas wird dann schnell mal zum Großprojekt.\n\n\nNatürlich gibt es viel zu tun beim klassischen Gemeinschaftsgärtnern: Man kümmert sich um gemeinschaftlich genutzte Flächen, es muss gepflanzt, gejätet, bewässert und, wenn alles klappt wie geplant, geerntet werden. Davon abgesehen kommen Menschen in den Garten, um zu lernen und Wissen über das Gärtnern, Bauen oder Nachhaltigkeit zu teilen. Und nicht zuletzt ist der Garten ein Ort für's Entspannen und eine tolle Zeit, die man mit anderen verbringt.\n\n![Fragen von Gemeinschaftsgaertnerinnen](https://github.com/community-garden/community-garden.github.io/wiki/images/questions-gif.gif)\n\n\n\nDinge wollen organisiert werden, Aufgaben erledigt. Kommunikation findet statt - manchmal so viel davon, dass der Überblick verloren geht!. Außerdem hat jeder einzelne noch ein Leben außerhalb des Gartenparadieses, das manchmal auch ganz schön stressig sein kann. \n\nUnd so haben wir fünf Leute zu unserer Mission gefunden: Wir wollen für die Menschen im Garten ein durchdachtes Tool entwickeln, das es einfacher macht, sich in der Gruppe zu organisieren, Wissen auszutauschen, Termine zu managen usw. Vielleicht auch, sich mit anderen Initiativen in Verbindung zu setzen oder vielleicht auch ein völlig neues Gartenprojekt zu starten.\n\n## Frag doch mal die Gemeinschaftsgärtner\\*innen\n\nWie wir bereits verraten haben, identifizieren wir uns fast vollständig mit den Menschen, die später von unserem Prototypen profitieren sollen. Es liegt also auf der Hand, dass wir bereits mit einigen eigenen Ideen gestartet sind. Diese würden wenigstens eine Hand voll Gärtner*innen sehr glücklich machen, wie z. B. ein digitaler Gießplan, eine optimierte Termin- und Aufgabenverwaltung oder eine interaktive Karte. Es wäre auch schön Sensordaten, die uns über den Zustand des Gartens und der Gewächshäuser informieren, zu haben.\n\n\nJedenfalls hatten wir das Gefühl: das ist alles ein bisschen subjektiv. Wie repräsentativ sind wir wirklich? Haben andere Gärtner*innen dieselben Probleme wie wir? Welche Lösungen oder Produkte werden überhaupt bereits genutzt, um das Gärtnern in Gemeinschaft zu organisieren? \n\n### Also haben wir eine erste Umfrage im Gartennetzwerk von Dresden gestartet.\n\n\n![Umfrageergebnisse](https://github.com/community-garden/community-garden.github.io/wiki/images/Umfrage___englisch_2x.png)\n\n\n\nBeim Betrachten der Umfrageergebnisse wurde das Bild von zukünftigen Nutzern unseres Tools immer klarer. Wir waren in der Lage, aus den gesammelten Informationen und natürlich einigen Charakteristika von Menschen, die wir kennen, drei Personas zu bauen: Jonas, Franziska und Günther. Die drei sollten von nun an unsere härtesten Kritiker sein.\n\n\nMit den Nutzerinformationen und unseren drei Personas entstand nun ein Plan nach dem anderen - und tatsächlich schien auch die ein oder andere Ursprungsidee bestätigt. Nun standen wir vor dem nächsten Problem: Diese vielen Ideen können wir unmöglich alle mit den uns zur Verfügung stehenden Ressourcen in einen Prototypen verpacken. Der RICE-Score half uns dabei, eine Rangliste zu bilden und uns auf einige wenige der vielversprechendsten Ideen zu einigen. Sie bilden für uns von nun an eine klare Vision in der Kreation des Prototypen.\n\n\nDas ist Franziska, unsere initiative Familienmanagerin.\n\n![Persona Franziska](https://github.com/community-garden/community-garden.github.io/wiki/images/Franziska__die_initiative_Familienmanagerin_2x.png)\n\nDas ist Jonas, unser nachhaltigkeits-getriebener Student.\n\n![Persona Jonas](https://github.com/community-garden/community-garden.github.io/wiki/images/Jonas__der_nachhaltige_Student_2x.png)\n\nDas ist Günther, unser passionierter Garten-Senior.\n\n![Persona Günther](https://github.com/community-garden/community-garden.github.io/wiki/images/Guenther__der_engagierte_Rentner_2x.png)\n\n\n"},{"basename":"Defining-the-problem-(EN).md","title":"Defining-the-problem","id":-245978162,"body":"## A community gardener's life\n\nLets be honest: Even gardening all by yourself isn‘t neccessarily an easy thing to do. Now imagine a whole group of individuals trying their best to create a green, fruitful and peaceful place right in the middle of the urban desert. Yup, you guessed it, this offers the chance to become a real project. \n\nOf course, there is some classic community gardening going on. This includes caring about some shared spaces, planting, weeding, watering and – if everything works out as planned – harvesting. Besides, people come to share their knowledge about planting, constructing, sustainability … or sometimes just to hang out and relax. \n\n![questions people have when sharing a garden space](https://github.com/community-garden/community-garden.github.io/wiki/images/questions-gif.gif)\n\n\n\nThings need to be organized. Tasks need to be done. People need to communicate about it (sometimes a lot!). Plus: Everybody has a life outside of the community garden paradise, which can be quite a hustle sometimes. \n\nSo this is how we found our mission: With an elaborate tool on their side, we want to make it easier for those groups and cooperatives to organize themselves, connect to other initiatives or maybe even start a new project from scratch to fulfil their vision.\n\n## Ask your local community gardeners\n\nAs we revealed before, nearly everyone of our project group identifies directly with the people that should benefit from our prototype solution in the future. So of course, we brought up some inital ideas of our own! So at the beginning, there was a list of features, that would make at least a handful of gardeners really happy, e.g. a digital wating plan, an optimized tool for events and tasks to be done or even an interactive map, that uses real time sensor data and informs us about things going on in the garden.\n\n\nAnyway, we considered the existing data base at that point kind of subjective. How representative could the few of us really be? How do our problems match those of other gardeners? What kind of solutions or products might be already in use to tackle those needs? \n\n### We set up a survey.\n\n![survey results](https://github.com/community-garden/community-garden.github.io/wiki/images/Umfrage___englisch_2x.png)\n\n\n\nAs we looked at those information, future users began to form in our minds and we were able to put all the existing data (and of course some images of people we know) into three personas: Jonas, Franziska und Günther. They were now supposed to be our toughest critics in the prototype development. \n\n\nWith the user data already gathered and the personas put in place, possible features began to pop up in our minds. Also earlier ideas seemed to be verified somehow. Putting all of our ideas in prototypes seemed just not managable with the existing (wo)manpower. But still, we were not able to agree on one, two or three main ideas giving us a straight guidance on creating a prototype. Using the RICE-Score now delivered us some ordinal support on our synthesis. \n\nThis is Franziska, our super engaged family manager.\n\n![Persona Franziska](https://github.com/community-garden/community-garden.github.io/wiki/images/Franziska__die_initiative_Familienmanagerin___EN_2x.png)\n\nThis is Jonas, our sustainability-driven university student.\n\n![Persona Jonas](https://github.com/community-garden/community-garden.github.io/wiki/images/Jonas__der_nachhaltige_Student___EN_2x.png)\n\nThis is Günther, our passionate senior gardener.\n\n![Persona Günther](https://github.com/community-garden/community-garden.github.io/wiki/images/Guenther__der_engagierte_Rentner___EN_2x.png)\n"},{"basename":"How-it-feels-to-turn-opinions-into-numbers-(EN).md","title":"How-it-feels-to-turn-opinions-into-numbers","id":250251158,"body":"## How it feels to turn opinions into numbers \n\nAs described in the [last chapter](/blog/post/-245978162), we were facing around 20 great ideas, all of them kinda tackling our users needs and pains. Priorization strongly recommended here!\nFirstly, we met in person. We decided to evaluate half of the ideas in a first meeting. This is how it went:\n\n1. We created a shared understanding of the method by presenting it briefly and discussing open questions.\n\n\n2. We set up a strict timetable for the next hour to get through at least 10 ideas.\n\n\n3. We started with the first idea:\n\n* One person pitches the idea (1“)\n* The team asks questions to concretize the idea (2“)\n* Every team member silently rates the presented idea in the dimensions reach (R), impact (I), confidence (C) and effort (E) (2“)\n* Ratings are collected in a very sophisticated excel sheet ;-) (1“)\n\n4. We repeated step 3 as many times as time allowed.\n\n\nBelieve it or not: it worked. We rated the other half of the features in a second meeting on BigBlueButton, as COVID19-restrictions forced us to. It turned out fine as well, as all of us were quite familiar with the method at that point.\n\n\nAfter some juggling with the rating data, we finally had our feature ideas prioritized. It felt great!\n\n## The winners\n\nSo here they are, our four most promising features identified by using the RICE method.\n\n![Top Features](https://github.com/community-garden/community-garden.github.io/wiki/images/TopFeatures_EN___1_2x.png)\n\n### 1. The Watering Plan\n\nA digital, interactive watering plan helps gardeners to faily and fexibly distribute their commitment in watering. Works much better than a spreadsheet.\n\n### 2. Garden Planner\n\nWorkshops and other exciting events at the garden become visible to the public. Exports into your personal calendar and manages attendees as well.\n\n### 3. What‘s up?\n\nOn a customizable dashboard, every gardener sees exactly what he or she needs to see. Combines content from other features and applications to one snackable page.\n\n### 4. Harvest me!\n\nHow to share a garden‘s crop is organized in this feature. Gives some sustainability to the community harvesting and helps those who don‘t dare to participate.\n"},{"basename":"Wie-es-sich-anfühlt,-Meinungen-in-Zahlen-zu-verwandeln-(DE).md","title":"Wie-es-sich-anfühlt,-Meinungen-in-Zahlen-zu-verwandeln","id":2084842409,"body":"## Wie es sich anfühlt, Meinungen in Zahlen zu verwandeln\n\nWie schon im [letzten Kapitel](/blog/post/1458380018/) beschrieben, hatten wir ungefähr 20 geniale Ideen, die alle irgendwie die Bedürfnisse und Probleme unserer Nutzer aufgriffen. Priorisieirung dringend benötigt!\nBeim ersten Mal haben wir uns persönlich getroffen. Für das erste Meeting haben wir uns für zunächst die Hälfte der Ideen vorgenommen. So lief es ab:\n\n1. Wir haben ein gemeinsames Verständnis der Methode hergestellt, indem wir sie kurz vorgestellt und offene Fragen diskutiert haben.\n\n\n2. Wir haben uns auf einen strengen Zeitplan für die nächste Stunde geeinigt, der uns durch mindestens 10 Ideen führen sollte.\n\n\n3. Wir begannen mit der ersten Idee:\n\n* Eine Person stellt die Idee vor (1 Minute)\n* Das Team stellt Rückfragen, um das Verständnis der Idee zu vertiefen (2 Minuten)\n* Jedes Teammitglied bewertet die Idee für sich in den folgenden Dimensionen: Reichweite, Wirkung, Vertrauen, Aufwand (2 Minuten)\n* Die Bewertungen werden gesammelt und in einem sehr komplizierten Excel-Dokument zusammengeführt ;-) (1 Minute)\n\n4. Wir wiederholten Schritt 3 solange wir konnten.\n\n\nUnglaublich, aber wahr: es hat funktioniert. Wir haben die zweite Hälfte in einem BigBlueButton-Meeting bewertet, da wir uns aufgrund der COVID19-Beschränkungen nicht mehr vor Ort treffen konnten. Funktioniert hat das genauso gut – wir waren ja auch bereits gut mit der Methode vertraut.\n\nNun war die Excel-Tabelle bereit für den letzten Schliff und spuckte uns bereitwillig eine priorisierte Rangliste unserer Ideen aus. Das war ein großartiges Gefühl!\n\n## Die Gewinner\n\nHier sind sie also, unser vier vielversprechendsten Features, die wir mit der RICE-Methode identifizieren konnten.\n\n![Top Features](https://github.com/community-garden/community-garden.github.io/wiki/images/TopFeatures_EN___1_2x.png)\n\n### 1. Der Gießplan\n\nEin digitaler, interaktiver Gießplan regelt die faire und flexible Verteilung der Gießeinsätze viel besser als ein Excel-Sheet.\n\n### 2. Gartenzeit\n\nWorkshops und andere coole Gartentermine werden öffentlich sichtbar. Kalender-Import und Teilnehmer-Management sind denkbare Benefits.\n\n### 3. Was geht?\n\nAuf einem individuellen Dashboard sehen Gärtner*innen genau das, was sie brauchen. Kombiniert Inhalte aus anderen Features und Anwendungen.\n\n### 4. Erntereif\n\nWie ein Garten seine Ernte verteilt, wird hier geklärt. Ein Feature für eine bessere Verwertung des kostbaren Ertrags und eher zurückhaltende Erntehelfer*innen.\n"}]},"path":"blog"}
