{"template":"__react_static_root__/src/containers/Post","sharedHashesByProp":{},"data":{"post":{"basename":"(EN)-How-it-feels-to-turn-opinions-into-numbers.md","title":"How-it-feels-to-turn-opinions-into-numbers","lang":"EN","id":-600077734,"body":"## How it feels to turn opinions into numbers \n\nAs described in the [last chapter](/blog/post/-245978162), we were facing around 20 great ideas, all of them kinda tackling our users needs and pains. Priorization strongly recommended here!\nFirstly, we met in person. We decided to evaluate half of the ideas in a first meeting. This is how it went:\n\n1. We created a shared understanding of the method by presenting it briefly and discussing open questions.\n\n\n2. We set up a strict timetable for the next hour to get through at least 10 ideas.\n\n\n3. We started with the first idea:\n\n* One person pitches the idea (1“)\n* The team asks questions to concretize the idea (2“)\n* Every team member silently rates the presented idea in the dimensions reach (R), impact (I), confidence (C) and effort (E) (2“)\n* Ratings are collected in a very sophisticated excel sheet ;-) (1“)\n\n4. We repeated step 3 as many times as time allowed.\n\n\nBelieve it or not: it worked. We rated the other half of the features in a second meeting on BigBlueButton, as COVID19-restrictions forced us to. It turned out fine as well, as all of us were quite familiar with the method at that point.\n\n\nAfter some juggling with the rating data, we finally had our feature ideas prioritized. It felt great!\n\n## The winners\n\nSo here they are, our four most promising features identified by using the RICE method.\n\n![Top Features](https://github.com/community-garden/community-garden.github.io/wiki/images/TopFeatures_EN___1_2x.png)\n\n### 1. The Watering Plan\n\nA digital, interactive watering plan helps gardeners to faily and fexibly distribute their commitment in watering. Works much better than a spreadsheet.\n\n### 2. Garden Planner\n\nWorkshops and other exciting events at the garden become visible to the public. Exports into your personal calendar and manages attendees as well.\n\n### 3. What‘s up?\n\nOn a customizable dashboard, every gardener sees exactly what he or she needs to see. Combines content from other features and applications to one snackable page.\n\n### 4. Harvest me!\n\nHow to share a garden‘s crop is organized in this feature. Gives some sustainability to the community harvesting and helps those who don‘t dare to participate.\n"}},"path":"blog/post/-600077734"}
